import os

import pendulum

BASE_PATH = os.environ.get("BASE_PATH", "/home/wrf_model")
WRF_WD = BASE_PATH + "/wrf"
DATA_PATH = BASE_PATH + "/data"

# wrf
WPS_PATH = WRF_WD + "/WPS-4.5"
OBSGRID_PATH = WRF_WD + "/OBSGRID"
WRF_PATH = WRF_WD + "/WRF-4.5.2-ARW"
# fnl ds083.2 https://rda.ucar.edu/datasets/ds083.2/dataaccess/#
DS083_2_PATH = DATA_PATH + "/ds083_2"
# gfs https://www.ftp.ncep.noaa.gov/data/nccf/com/gfs/prod
GFS_PATH = DATA_PATH + "/gfs_data"
# obsgrid 地面和高空数据合并
OBS_DATA_PATH = DATA_PATH + "/obs_data"
# obsgrid 地面站数据
OBS_SURFACE_DATA_PATH = DATA_PATH + "/obs_surface_data"
# obsgrid 高空数据
OBS_UPPER_DATA_PATH = DATA_PATH + "/ds351_0"
# geogrid 输出文件路径
GEOGRID_PATH = DATA_PATH + "/geogrid_file"
# ungrib 输出文件路径
UNGRIB_PATH = DATA_PATH + "/ungrib_file"
# metgrid 输出文件路径
METGRID_PATH = DATA_PATH + "/metgrid_file"
# wrf 输出文件路径
WRFOUT_DATA_PATH = DATA_PATH + "/wrfout_data"

# stilt
STILT_WD = os.environ.get("STILT_WD", "/home/wrf_model/stilt/jinan_stilt")
# stilt 输出文件路径
STILT_DATA_PATH = DATA_PATH + "/stiltout_data"

# aermod
AERMOD_WD = BASE_PATH + "/aermod"
MMIF_PATH = BASE_PATH + "/mmif/MMIF4.1"

# 开始结束时间，输入UTC时间
START_DATE: pendulum.DateTime = pendulum.now()
END_DATE: pendulum.DateTime = pendulum.now()

# AERMOD config
# 机场气象数据
NOAA_AIR_FILE = "548230-99999-2024"


# 排放分配系数
# fmt: off
emission_allocation_coefficient_hour = {
    "电力生产": [0.0324, 0.03, 0.0288, 0.0284, 0.0292, 0.0316, 0.0354, 0.0403, 0.0433, 0.0457, 0.0479, 0.0486, 0.0495, 0.0497, 0.0501, 0.05, 0.0497, 0.0489, 0.0477, 0.0473, 0.0466, 0.044, 0.0397, 0.0352, ],
    "电力热力源其他": [0.026, 0.007, 0.007, 0.007, 0.007, 0.007, 0.007, 0.029, 0.045, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.066, 0.063, 0.037, 0.037, 0.037, 0.037, 0.037, ],
    "工业源": [0.026, 0.007, 0.007, 0.007, 0.007, 0.007, 0.007, 0.029, 0.045, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.066, 0.063, 0.037, 0.037, 0.037, 0.037, 0.037, ],
    "移动源": [0.0172, 0.0132, 0.0138, 0.015, 0.0157, 0.0157, 0.029, 0.0564, 0.0599, 0.059, 0.0594, 0.054, 0.0501, 0.0588, 0.06, 0.062, 0.0594, 0.0574, 0.0557, 0.049, 0.0454, 0.0417, 0.0398, 0.0216, ],
    "油品储运销": [0.026, 0.007, 0.007, 0.007, 0.007, 0.007, 0.007, 0.029, 0.045, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.066, 0.063, 0.037, 0.037, 0.037, 0.037, 0.037, ],
    "生活源": [0.018, 0.018, 0.018, 0.018, 0.018, 0.036, 0.075, 0.075, 0.038, 0.038, 0.035, 0.045, 0.035, 0.03, 0.03, 0.03, 0.038, 0.075, 0.075, 0.075, 0.075, 0.054, 0.018, 0.018, ],
    "农业源": [0.0206, 0.0194, 0.0194, 0.0177, 0.0189, 0.021, 0.0288, 0.0329, 0.0473, 0.0576, 0.07, 0.0782, 0.0685, 0.0823, 0.0503, 0.07, 0.0597, 0.0453, 0.0309, 0.0268, 0.0226, 0.0206, 0.0206, 0.0206, ],
    "扬尘源": [0.018, 0.018, 0.018, 0.018, 0.018, 0.036, 0.075, 0.075, 0.038, 0.038, 0.035, 0.045, 0.035, 0.03, 0.03, 0.03, 0.038, 0.075, 0.075, 0.075, 0.075, 0.054, 0.018, 0.018, ],
    "废弃物处理源": [0.026, 0.007, 0.007, 0.007, 0.007, 0.007, 0.007, 0.029, 0.045, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.068, 0.066, 0.063, 0.037, 0.037, 0.037, 0.037, 0.037, ],
    "生物质开放燃烧源": [0.018, 0.018, 0.018, 0.018, 0.018, 0.038, 0.075, 0.075, 0.038, 0.038, 0.03, 0.045, 0.045, 0.038, 0.03, 0.03, 0.038, 0.075, 0.075, 0.075, 0.075, 0.054, 0.018, 0.018, ],
    "其他": [(1 / 24)] * 24,  # 默认分配系数
}
